app/Helpers/setting_helper.php

    function get_setting($key, $default = '')
    {
        $db = \Config\Database::connect();
        $builder = $db->table('settings');
        $row = $builder->where('key', $key)->get()->getRow();
---
SELECT *
FROM `settings`
WHERE `key` = 'maintenance_mode'