app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `classes`
JOIN `user_classes` ON `user_classes`.`class_id` = `classes`.`id`
WHERE `user_classes`.`user_id` = '1'
SELECT COUNT(DISTINCT class_courses.course_id) AS total
FROM `class_courses`
JOIN `user_classes` ON `user_classes`.`class_id` = `class_courses`.`class_id`
WHERE `user_classes`.`user_id` = '1'
 LIMIT 1
---
    public function teacher()
    {
        $role = session()->get('role');
        if (!in_array($role, ['teacher', 'admin']))
            return redirect()->to('/login');

        $classModel = new ClassModel();
        $courseModel = new CourseModel();
        $teacherId = session()->get('user_id');

        if ($role === 'teacher') {
            $classCount = $classModel->join('user_classes', 'user_classes.class_id = classes.id')
                ->where('user_classes.user_id', $teacherId)
                ->countAllResults();

            $courseCountData = (new \App\Models\ClassCourseModel())
                ->select('COUNT(DISTINCT class_courses.course_id) AS total', false)
                ->join('user_classes', 'user_classes.class_id = class_courses.class_id')
                ->where('user_classes.user_id', $teacherId)
                ->first();