app/Controllers/Settings.php

    public function index()
    {
        if (session()->get('role') !== 'teacher')
            return redirect()->to('/login');

        $settingsModel = new SettingsModel();
        $data['settings'] = $settingsModel->findAll();
---
SELECT *
FROM `settings`

    public function save()
    {
        if (session()->get('role') !== 'teacher')
            return redirect()->to('/login');

        $settingsModel = new SettingsModel();
        $settings = $this->request->getPost('settings'); // Expecting array: key => value

        foreach ($settings as $key => $value) {
            $settingsModel->where('key', $key)->set(['value' => $value])->update();
---
UPDATE `settings` SET `value` = 'ExamExpert'
WHERE `key` = 'site_name'