app/Controllers/Student.php

SELECT *
FROM `user_classes`
WHERE `user_id` = '2'
 LIMIT 1
SELECT *
FROM `class_courses`
WHERE `class_id` = '1'
SELECT `exams`.*, `courses`.`course_name`
FROM `exams`
JOIN `courses` ON `courses`.`id` = `exams`.`course_id`
WHERE `exams`.`course_id` IN ('1')
AND `exams`.`status` = 'active'
SELECT *
FROM `exam_attempts`
WHERE `exam_id` = '1'
AND `student_id` = '2'
 LIMIT 1
---
    public function exams()
    {
        $userId = session()->get('user_id');
        $userClassModel = new UserClassModel();
        $classCourseModel = new ClassCourseModel();
        $examModel = new ExamModel();
        $attemptModel = new ExamAttemptModel();

        // Get student's class
        $userClass = $userClassModel->where('user_id', $userId)->first();
        if (!$userClass) {
            $data['exams'] = [];
            return view('student/exams/index', $data);
        }

        $classId = $userClass['class_id'];

        // Get courses assigned to this class
        $assignedCourses = $classCourseModel->where('class_id', $classId)->findAll();
        $courseIds = array_column($assignedCourses, 'course_id');

        if (empty($courseIds)) {
            $data['exams'] = [];
            return view('student/exams/index', $data);
        }

        // Get active exams for these courses
        $exams = $examModel->select('exams.*, courses.course_name')
            ->join('courses', 'courses.id = exams.course_id')
            ->whereIn('exams.course_id', $courseIds)
            ->where('exams.status', 'active')
            ->findAll();

        // Check attempt status for each exam
        foreach ($exams as &$exam) {
            $attempt = $attemptModel->where('exam_id', $exam['id'])
                ->where('student_id', $userId)
                ->first();